function MOD_载入完成时执行() {

    // sets();
    // 时间步长 = 0
    // _G_ = 0
    // 初始质点数 = 0
    // 加速度上限 = 0
    // sets();

    for (let i = 0; i < 初始质点数; i++) {
        let mass = Math.round(生成随机数(30, 100))
        创建质点(
            new 质点(
                mass,
                1,
                new 生成随机向量(),
                new 生成随机向量(2), {
                    颜色: 生成随机颜色(),
                    半径: mass / 2
                }
            )
        )
    }
    

    创建电场(
        new 电场(
            new 向量2(0, -0.03),
            取零向量(),
            100,
            形状枚举.圆,
            undefined
        )
    )


}